//»­²¼µÄ´óÐ¡
var canvasSize = {"maxX": 1024, "maxY": 768};

//Êý×éÖÐÃ¿¸öÔªËØ±íÊ¾Ò»¸öµãµÄ×ø±ê[x,y,z]£¬ÕâÀïÒ»¹²ÓÐ9¸öµã
var vertex_pos = [
    [0, 0, 0],
    [700, 0, 0],
    [1000, 0, 0],
    [100, 400, 0],
    [600, 450, 0],
    [1000, 400, 0],
    [50, 650, 0],
    [700, 700, 0],
    [1000, 700, 0]
];

//¶¥µãÑÕÉ«Êý×é£¬±£´æÁËÉÏÃæ¶¥µãÊý×éÖÐÃ¿¸ö¶¥µãÑÕÉ«ÐÅÏ¢[r,g,b]
var vertex_color = [
    [0, 0, 255],
    [0, 255, 0],
    [0, 255, 255],
    [255, 255, 0],
    [0, 255, 255],
    [0, 255, 0],
    [0, 255, 0],
    [0, 200, 100],
    [255, 255, 0]
];

//ËÄ±ßÐÎÊý×é£¬Êý×éÖÐÃ¿¸öÔªËØ±íÊ¾Ò»¸öËÄ±ßÐÎ£¬ÆäÖÐµÄËÄ¸öÊý×ÖÊÇËÄ±ßÐÎËÄ¸ö¶¥µãµÄindex£¬ÀýÈçvertex[polygon[2][1]]±íÊ¾µÚÈý¸ö¶à±ßÐÎµÄµÚ2¸ö¶¥µãµÄ×ø±ê
var polygon = [
    [0, 1, 4, 3],
    [1, 2, 5, 4],
    [3, 4, 7, 6],
    [4, 5, 8, 7]
];
